data/azure/aks/cpu/64/node-107/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     41176.52
    fsyncs/s:                     52716.18

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               643.38

General statistics:
    total time:                          10.0006s
    total number of events:              938924

Latency (ms):
         min:                                    0.00
         avg:                                    0.01
         max:                                   26.18
         95th percentile:                        0.02
         sum:                                 9881.05

Threads fairness:
    events (avg/stddev):           938924.0000/0.00
    execution time (avg/stddev):   9.8810/0.00